Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Du kannst zwischen den beiden Versionen wechseln, so oft du willst und du kannst unabhängig voneinander in jeder Version Änderungen 'commiten'
pl: Mozesz zmieniac pomiedzy tymi wersjami tak szesto jak tylko zechcesz, niezaleznie od tego, w kazdej z tych wersji mozesz wykonać 'commit'

source: Du könntest sie einfach bitten es von deinem Computer herunterzuladen, aber falls sie das tun während du experimentierst oder das Skript verbesserst könnten sie in Schwierigkeiten geraten.
pl: Móglbyś ich po prostu poprosić, by zładowali go po prostu bezpośrednio z twojego komputera, ale jeśli to zrobią podczas gdy ty eksperymentujesz czy poprawiasz pracę nad skryptem, mogliby wpaść w tarapaty.

source: Du magst Kopieren und Einfügen von Hashes nicht?
pl: Nie lubisz kopiować i wklejać hash-ów?

source: Du magst dich fragen, ob 'Branches' diesen Aufwand Wert sind.
pl: Może pytasz się, czy BRANCHES są warte tego zachodu.

source: Du magst vielleicht auch das automatische Ausführen von *git gc* abstellen:
pl: Jeśli chcałbyś zapobiec automatyycznemu wykonywaniu *git gc*:

source: Du merkst, dass du vergessen hast eine Datei hinzuzufügen?
pl: Zauważasu, że zapomniałeś dodać jakiegoś pliku?

source: Du solltes etwas sehen wie:
pl: Powinieneś zobaczyć coś jak:

source: Du solltest nun +.git/objects/49/993fe130c4b3bf24857a15d7969c396b7bc187+ finden, was dem SHA1-Hash-Wert seines Inhalts entspricht:
pl: Powinieneś znaleźć +.git/objects/49/993fe130c4b3bf24857a15d7969c396b7bc187+, co odpowiada kluczowi SHA1 jego zawartości:

source: Du solltest nun drei Objekte sehen.
pl: Powinieneś ujrzeć teraz 3 objekty.

source: Du steckst mitten in der Arbeit, als es heißt alles fallen zu lassen um einen neu entdeckten Fehler in 'Commit' `1b6d...` zu beheben:
pl: Akurat gdy strasznie zajety biezacymi zadaniami projektu, otrzymujesz polecenie zajecie sie bledem w 'commit' 1b6d...

source: Du willst alle Deine Änderungen lieber in einem fortlaufenden Abschnitt und hinter den offiziellen Änderungen sehen.
pl: Chciałbyś raczej widzieć twoje zmiany uporządkowane chronologichnie w jednej sekcji i za oficjalnymi zmianami.

source: Du willst deine laufenden Arbeiten für dich behalten und andere sollen deine 'Commits' nur sehen, wenn du sie hübsch organisiert hast.
pl: Chcesz wszystkie bieżące prace zachować dla siebie, a wszyscy inni powinni widzieć twoje COMMITS tylko jeśli je ładnie zorganizowałeś.

source: Du willst noch ein paar Änderungen zu deinem letzten 'Commit' hinzufügen?
pl: Chcesz wprowadzić jeszcze inne zmiany do ostatniego 'commit'?

source: Du willst zahlreiche, vor Manipulation geschützte, redundante Datensicherungen an unterschiedlichen Orten?
pl: Chcesz posiadać liczne, wolne od manipulacji, redudante kopie bezpieczeństwa w różnych miejscach

source: Du wirst Dich fragen, was mit identischen Dateien ist.
pl: Pytasz się, a co w przypadku identycznych plików?

source: Du wirst folgendes sehen: +.git/objects/aa/823728ea7d592acc69b36875a482cdf3fd5c8d+.
pl: Zobaczysz coś takiego: +.git/objects/aa/823728ea7d592acc69b36875a482cdf3fd5c8d+.

source: Dumme Fehler verschmutzen meine 'Repositories'.
pl: Głupie błędy zaśmiecają moje repozytoria.

source: Durch Bilden von SHA1-Hash-Werten aus den SHA1-Hash-Werten anderer Objekte, erreichen wir Integrität auf allen Ebenen.
pl: Poprzez tworzenie kluczy SHA1 z kluczy SHA1 innych objektów, osiągniemy integralność danych na wszystkich poziomach.

source: Durch cleveres verlinken erzeugt dieses Skript ein neues Arbeitsverzeichis, das seine Versionsgeschichte mit dem original 'Repository' teilt:
pl: Poprzez sprytne przelinkowania skrypt ten tworzy nowy katalog roboczy, który dzieli swoją historię wersji z orginalnym repozytorium:

source: Durch das Herauspicken der Rosinen kannst du einen 'Branch' konstruieren, der nur endgültigen Code enthält und zusammengehörige 'Commits' gruppiert hat.
pl: Poprzez pousuwanie rodzynek możesz tak skonstruować BRANCH, który posiada jedynie końcowy kod i zależne od niego COMMITS pogrupowane COMMITS.

source: Durch die Verwendung von Identitätsnummern als Dateiname, zusammen mit ein paar Sperrdateien und Zeitstempeltricks, macht Git aus einem einfachen Dateisystem eine effiziente und robuste Datenbank.
pl: Poprzez wykorzystanie tych numerów identyfikacyjnych jako nazwy plików razem z kilkoma innymi trikami związanymi z plikami blokującymi i znacznikami czasu, Git zamienia twój prosty system plików na produktywną i solidną bazę danych.

source: Dustin Sallings, Alberto Bertogli, James Cameron, Douglas Livingstone, Michael Budde, Richard Albury, Tarmigan, Derek Mahar, Frode Aannevik, Keith Rarick, Andy Somerville, Ralf Recker, Øyvind A. Holm, Miklos Vajna, Sébastien Hinderer, Thomas Miedema, Joe Malin, und Tyler Breisacher haben Korrekturen und Verbesserungen beigesteuert.
pl: Dustin Sallings, Alberto Bertogli, James Cameron, Douglas Livingstone, Michael Budde, Richard Albury, Tarmigan, Derek Mahar, Frode Aannevik, Keith Rarick, Andy Somerville, Ralf Recker, Øyvind A. Holm, Miklos Vajna, Sébastien Hinderer, Thomas Miedema, Joe Malin, i Tyler Breisacher przyczynilli się do poprawek i korektur.

source: Ebenso grundlegende Funktionen wie das Durchsuchen der Chronik oder das 'comitten' einer Änderung.
pl: Również takie podstawowe funkcje, jak przeszukanie historii czy 'commit' jakiejś zmiany.

source: Ebenso scheitert der Versuch einen 'Branch' durch ein 'move' zu überschreiben, wenn das einen Datenverlust zur Folge hat.
pl: Również nie uda się próba przesunięcia 'branch' poleceniem 'move', jeśliby miałoby to oznaczać utratę danych.

source: Ebenso, wenn Git Dateien vergessen soll:
pl: To samo, gdy chcesz by GIT zapomnial o plikach:

source: Eigenarten der Anwendung
pl: Charakterystyka zastosowania

source: Ein 'Commit' kann mehrere Eltern haben, welchem folgen wir also?
pl: 'commit' moze posiadac wiecej rodzicow, za którym właściwie iść?

source: Ein 'Commit' ohne die *-a* Option führt nur den zweiten Schritt aus und macht nur wirklich Sinn, wenn zuvor eine Anweisung angewendet wurde, welche den Index verändert, wie zum Beispiel *git add*.
pl: Wykonanie 'commit' bez opcji *-a* wykona jedynie drugi wspomniany krok i ma jedynie sens, jeśli poprzednio wykonano komendę, która dokonała zmian w indexie, na przykład *git add*.

source: Ein 'bare Repository' übernimmt die Rolle des Hauptserver in einem zentralisierten Versionsverwaltungssystem: Das Zuhause deines Projekts.
pl: BARE REPOSITORY przejmuje rolę głównego serwera w scentralizowanych systemach kontroli wersi: dom trojego projektu

source: Ein Auto, das repariert werden soll, steht unbenutzt in der Garage bis ein Ersatzteil geliefert wird.
pl: Popsuty samochod stoi w garazu nieuzywany do czasu dostarczenia czesci zamiennej.

source: Ein Entwickler, dessen Unterstützung für eine Schlüsselstelle im Projekt wichtig ist, verlässt das Team. In allen Fällen musst du alles stehen und liegen lassen und dich auf eine komplett andere Aufgabe konzentrieren.
pl: Programista odpowiedzialny za podejmowanie kluczowych decyzji projektu opuszcza team. W wszystkich tych przypadkach musisz zaprzestac pracy nad bierzacymi zadaniami i poswiecic sie rozwiazaniu problemu.

source: Ein Liste aller 'Branches' bekommst du mit:
pl: Listę wszystkich BRANCHES otrzymasz poprzez:

source: Ein Prototyp muss warten, bis ein Baustein fabriziert wurde, bevor die Konstruktion fortgesetzt werden kann.
pl: Prototyp musi czekac na wyprodukowanie części zanim mozna podjac dalsza konstrukcje.

source: Ein SHA1-Hash-Wert selbst ist eine Zeichenfolge von Bytes.
pl: sam kluch SHA1 też jest łańcuchem znaków w formie Bajtów.

source: Ein Versionsverwaltungssystem zum Beispiel ist eine ungeeignete Lösung um Fotos zu verwalten, die periodisch von einer Webcam gemacht werden.
pl: Na przykład nie jest dobrym sposobem zastosowanie systemu kontroli wersji do zarządzania zdjęciami wykonywanymi periodycznie przez kamerę internetową-.

source: Ein anderes Beispiel ist ein Projekt, das von Firmware abhängig ist, welche die Form einer großen Binärdatei annimmt.
pl: Innym przykładem może być projekt, który zależny jest od firmware przyjmującej kształt wielkiej danej w formie binarej.

source: Ein anderes Mal willst du nur kurz zu einem älteren Stand springen.
pl: Innym razem chcesz tylko na moment przejść do jednedo z poprzednich stanów.

source: Ein beliebter Vertreter ist +workdir/git-new-workdir+.
pl: Ulubionym przedstawicielem jest +workdir/git-new-workdir+.

source: Ein dummer Aberglaube
pl: Głupi przesąd

source: Ein einfacher Trick ist es die in Git integrierte Aliasfunktion zu verwenden um die am häufigsten benutzten Anweisungen zu verkürzen:
pl: Prostą sztuczką może być korzystanie z zintegrowanej w git funkcji aliasu, by skrócić najczęściej stosowane polecenia:

source: Ein einzeiliger Bugfix hier, eine neue Funktion da, verbesserte Kommentare und so weiter.
pl: Jakaś poprawka tutaj, jakaś nowa funkcja gdzie indziej, poprawienie komentarzy itd.

source: Ein kleines Projekt mag nur einen Bruchteil der Möglichkeiten benötigen, die so ein System bietet.
pl: Mały projekt wykorzysta prawdopodobnie tylko ułamek możliwości systemu.

source: Ein klischeehafter Computerwissenschaftler zählt von 0 statt von 1. Leider, bezogen auf 'Commits', hält sich Git nicht an diese Konvention.
pl: Stereotypowegy informatyk liczy od 0 zamiast 1. Niestety, w kwestii 'commits' GIT nie podąża za tą konwencją.

source: Ein nacktes ('bare') 'Repository' wird so genannt, weil es kein Arbeitsverzeichnis hat.
pl: Gołe (BARE) REPOSITORY jest tak nazywane, ponieważ nie posiada katalogu roboczego

source: Ein negativer Rückgabewert beendet die 'bisect'-Operation sofort.
pl: Jeśli wartość zwrócona jest ujemna, program 'bisect' przerywa pracę.

source: Ein paar Git-Probleme habe ich bisher unter den Teppich gekehrt.
pl: O kilku problemach mogących wystąpić z GIT nie wspomniałem do tej pory.

source: Ein schwerwiegender Fehler in der veröffentlichten Version tritt ohne Vorwarnung auf.
pl: powazny blad w opublikowanej wersji wystepuje bez ostrzezenia.

source: Ein unmittelbarer Vorteil ist, wenn aus irgendeinem Grund ein älterer Stand benötigt wird, ist keine Kommunikation mit dem Hauptserver notwendig.
pl: Jedną z bezpośrednich zalet jest to, że gdykolwiek potrzebny będzie jakiś starszy stan, komunikacja z głównym serwerem będzie zbędna.

source: Ein weit verbreitetes Missverständnis ist, dass verteilte System ungeeignet sind für Projekte, die ein offizielles zentrales 'Repository' benötigen.
pl: Szeroko rozpowszechnianym nieporozumieniem jest opinia, że rozproszony system nie nadaje się dla projektów wymagających oficjalnego centralnego repozytorium.

source: Ein zuverlässiges, vielseitiges Mehrzweck-Versionsverwaltungswerkzeug, dessen außergewöhnliche Flexibilität es schwierig zu erlernen macht, ganz zu schweigen davon, es zu meistern.
pl: Niezawodne, wielostronne narzędzie do kontroli wersji, jego niezwykła elastyczność sprawia trudności w poznaniu, nie wspominając o samym użyciu.

source: Eine Datei umzubenennen ist das selbe wie sie zu löschen und unter neuem Namen hinzuzufügen.
pl: Zmienic nazwe pliku, to to samo co jego skasowanie ponowne utworzenie z nowa nazwa.

source: Eine Folge von Git's verteilter Natur ist, dass die Chronik einfach verändert werden kann.
pl: Jedną z charakterystycznych cech podzielnej natury git jest to, że jego kronika historii może być zmieniana.

source: Eine Kopie eines mit Git verwalteten Projekts bekommst du mit:
pl: Kopię projektu zarządzanego za pomocą GIT uzyskasz poleceniem:

source: Eine Lösung ist es, Dein Projekt in kleinere Stücke aufzuteilen, von denen jedes nur die in Beziehung stehenden Dateien enthält.
pl: Jednym z możliwych rozwiązań mogłoby być podzielenie twojego projektu na kilka mniejszych, w których znajdują się jedynie od siebie zależne pliki.

source: Eine Synchronisierung mittels 'merge', 'push' oder 'pull' ist nicht notwendig.
pl: Synchronizacja za pomocą 'merge', 'push', czy 'pull' nie będzie konieczna.

source: Eine `bzr-git`-Erweiterung lässt Anwender von Bazaar einigermaßen mit Git 'Repositories' arbeiten.
pl: Rozszerzenie `Bzr-git` pozwala użytkownikom Bazar dość łatwo pracować z repozytoriami Git

source: Eine gute erste Annäherung ist, dass alles was eine zentralisierte Versionsverwaltung kann, ein gut durchdachtes verteiltes System besser kann.
pl: Jednym z pierszych pozytywnych zbliżeń, jest to, iż wszystko co potrafi scentralizowany system kontroli wersji, dobrze dopracowany system rozproszony potrafi lepiej.

source: Eine unzuverlässige Internetverbindung stört mit Git nicht sehr, aber sie macht die Entwicklung unerträglich, wenn sie so zuverlässig wie ein lokale Festplatte sein sollte.
pl: Niesolidne połączenie internetowe ma niezbyt duży wpływ na git, praca staje się jednak prawie nie możliwa, gdy wymagana jest niezawodność porównywalny z lokalnym dyskiem.

source: Einen Klon zu erstellen ist aufwendiger als in anderen Versionsverwaltungssystemen, wenn ein längerer Verlauf existiert.
pl: Wykonanie klonu jest bardziej kosztowniejsze niż w innych systemach kontrli wersji jeśli istnieje dłuższa historia.

source: Einen SHA1-Hash-Wert kann man sich als eindeutige 160-Bit Identitätsnummer für jegliche Zeichenkette vorstellen, welche Dir in Deinem ganzen Leben begegnen wird.
pl: Klucz hashujący SHA1 mogłabyś wyobrazić sobie jako składający się ze 160 bitów numer identyfikacyjny jednoznacznie opisujący dowolny łańcuch znaków, i który spotkasz w sowim życiu jeden jedyny raz.

source: Eines Tages brauchst du vielleicht dringend einen Schraubendreher, dann bist du froh mehr als nur einen einfachen Flaschenöffner bei dir zu haben.
pl: Być może pewnego dnia będziesz pilnie potrzebawała użyć śrubokrętu, ucieszysz się, że masz przy sobie coś więcej niż tylko zwykły otwieracz do butelek.

source: Einfach:
pl: Proste;

source: Einfacher geht das mit dem `hg-fast-export.sh` Skript, welches es hier gibt:
pl: Jeszcze łatwiej dokonamy tego skryptem hg-fast-export.sh, który możemy tu znaleźć:

source: Einfaches Veröffentlichen
pl: Uproszczone publikowanie

source: Einige Anwender möchten nur ein Browserfenster geöffnet haben und benutzen Tabs für unterschiedliche Webseiten.
pl: Niektórzy użytkownicy wolą mieć otwarte tylko jedno okno przeglądarki i korzystają z tabs dla różnych stron

source: Einige Entwickler setzen sich nachhaltig für die Unantastbarkeit der Chronik ein, mit allen Fehlern, Nachteilen und Mängeln.
pl: Niektórzy programiści zarzekają sie w kwestii nienaruszalności historii - ze wszystkimi jej błędami in niedociągnięciami.

source: Einige Git Anweisungen lassen Dich ihn manipulieren.
pl: Niektóre komendy git pozwolą ci nim manipulować.

source: Einige Projekte erfordern, dass dein Code überprüft werden muss bevor er akzeptiert wird, du musst also warten, bis der erste Teil geprüft wurde, bevor du mit dem zweiten Teil anfangen kannst.
pl: Niektore projekty wymagaja sprawdzenia twojego kodu zanim zostanie zaakceptoany, musisz wiec czekac, zanim pierwsza czesc zostanie sprawdzona, nim bedziesz mogl zaczac z następną część.

source: Einige Versionsverwaltungssysteme zwingen Dich explizit eine Datei auf irgendeine Weise für die Bearbeitung zu kennzeichnen.
pl: Niektóre systemy kontroli wersji zmuszają cię, by w jakiś sposób oznaczyć pliki nad którymi pracujesz.

source: Einige lassen sich einfach mit Skripten und 'Hooks' lösen, andere erfordern eine Reorganisation oder Neudefinition des gesamten Projekt und für die wenigen verbleibenden Beeinträchtigungen kannst Du nur auf eine Lösung warten.
pl: Niektóre z nich można łatwo rozwiązać korzystając ze skryptów i 'Hooks', inne wymagają reorganizacji i ponownego zdefiniowania całego projektu, a na rozwiązanie kilku innych uniedogodnień możesz tylko uzbroić sie w cierpliwość i czekać na rozwiązanie.

source: Einige plädieren dafür, den ``master'' 'Branch' unangetastet zu lassen und für seine Arbeit einen neuen 'Branch' anzulegen.
pl: Wielu opowiada się za pozostawieniem MASTERBRANCH w stanie dziewiczym i założeniu dla wykonania pracy nowego BRANCH

source: Einleitung
pl: Wprowadzenie

source: Entfernte 'Branches'
pl: Oddalone 'Branches'

source: Entschuldigung, wir sind umgezogen.
pl: Przepraszamy, przeprowadziliśmy się

source: Entwickler 'clonen' dein Projekt davon und 'pushen' die letzten offiziellen Änderungen dort hin.
pl: Programiści klonują twój projekt stamtąd i PUSHEN ostatnie oficjalne zmiany na niego.

source: Entwickler arbeiten regelmäßig an einem Projekt, veröffentlichen den Code aber nur, wenn sie ihn für vorzeigbar halten.
pl: Programiści regularnie pracują nad projektem, upubliczniają kod jednak dopiero, jeśli uznają, że nadaje sie do pokazania.

source: Entwickler brauchen SSH Zugriff für die vorherigen 'pull' und 'push' Anweisungen.
pl: Programiści potrzebują dostęp SSH by móc wykonać polecenia PULL i PUSH.

source: Er muss sicher sein, aber nicht privat.
pl: Musi być bezpieczne, jednak nie musi być prywatne

source: Erinnere Dich an das erste Kapitel:
pl: Przypomnij sobie pierwszy rozdział:

source: Erinnere Dich, dass ein 'Pull' hinter den Kulissen einfach ein *fetch* gefolgt von einem *merge* ist.
pl: Przypomnij sobie, że 'pull' za kulisami to to samo co 'fetch' z następującym za nim *merge*.

source: Erste Schritte
pl: Pierwsze kroki

source: Erstelle ein Git 'Repository' für deine Dateien:
pl: Utwóż GIT REPOSITORY dla twoich danych

source: Erstelle ein Git 'Repository' und 'commite' deine Dateien auf dem einen Rechner.
pl: Utwóż GIT REPOSITORY i COMMITE twoje dane na komputerze.

source: Erstelle eine Dummy-Datei um dieses Problem zu umgehen.
pl: Aby obejść ten problem wystarczy utworzyć w takim katalogu plik dummy.

source: Erstelle zum Beispiel aus folgendem Listing eine temporäre Datei, z.B. `/tmp/history`: ---------------------------------- commit refs/heads/master committer Alice <alice@example.com> Thu, 01 Jan 1970 00:00:00 +0000 data <<EOT Initial commit.
pl: Utwórz na przykład z następującej listy tymczasowy plik, na przykład: `/tmp/history`: ---------------------------------- commit refs/heads/master committer Alice <alice@example.com> Thu, 01 Jan 1970 00:00:00 +0000 data <<EOT Initial commit.

source: Es enthält nur Dateien, die normalerweise im '.git' Unterverzeichnis versteckt sind.
pl: Posiada jedynie dane, które są zwykle schowane w podkatalogu .git.

source: Es gibt drei Arten von Objekten die uns betreffen: 'Blob'-, 'Tree'-, und 'Commit'-Objekte.
pl: Istnieją trzy rodzaje objektów, które nas interesują: 'blob', 'tree'-, i 'commit'.

source: Es gibt geringfügige Unterschiede bei mbox-basierten eMail Anwendungen, aber wenn Du eine davon benutzt, gehörst Du vermutlich zu der Gruppe Personen, die damit einfach umgehen können ohne Anleitungen zu lesen.!
pl: Występują minimalne różnice między aplikacjami emailowymi bazującymi na mbox, ale jeśli korzystasz z takiej, należysz do grupy ludzi która za pewne umią się z nimi obchodzić bez czytania instrukcji!

source: Es gibt gleich noch viel mehr über den 'clone' Befehl zu sagen.
pl: O poleceniu CLONE można przytoczyć jeszcze wiele innych wątków.

source: Es gibt mindestens 3 Lösungen.
pl: Istnieja przynajmniej 3 rozwiazania.

source: Es gibt nichts, was irgendein Versionsverwaltungssystem dagegen machen kann, aber der Standard Git Anwender leidet mehr darunter, weil normalerweise der ganze Verlauf geklont wird.
pl: Nie wymyślono jednak do tej pory niczego w żadnym systemie kontroli wersji, by móc temu zapobiec, tutaj jednak użytkownik GIT cierpi najbardziej, ponieważ w normalnym wypadku klonuje cały przebieg projektu.

source: Es gibt viele Gründe warum man einen älteren Stand sehen will, aber das Ergebnis ist das selbe.
pl: Jest wiele powodów, dla których można chcieć zobaczyć straszy stan, wynik jednak jest zawsze taki sam.

source: Es ist akzeptabel, für Datensicherungen und einfaches Synchronisieren, mit 'tarball' Archiven oder *rsync* zu arbeiten.
pl: Można zaakceptować, dla ochrony danych i prostej synchonizacji, pracę z archiwami TARBALL albo *rscnc*.

source: Es ist als ob der Hauptserver gespiegelt wird.
pl: Wygląda to jak klonowanie serwera.

source: Es ist einfach mit Git das zu bekommen was du willst und oft führen viele Wege zum Ziel.
pl: Korzystajac z GIT latwo mozna osiagnac cel, czasami prowadza do niego rozne drogi.

source: Es ist einfach, diesen Trick auf eine beliebige Anzahl von Teilen zu erweitern.
pl: Dość łatwo zastosować tą samą sztuczkę na dowolną ilość części.

source: Es ist genauso einfach rückwirkend zu 'branchen': angenommen, du merkst zu spät, dass vor sieben 'Commits' ein 'Branch' erforderlich gewesen wäre.
pl: Równie łatwo można spowrotem BRANCHEN: przyjmując, spostrzegasz za późno, że powinieneś 7 'commit' wcześniej utworzyć 'branch'-

source: Es ist vergleichbar mit dem kurzzeitigen Umschalten des Fernsehkanals um zu sehen was auf dem anderen Kanal los ist.
pl: Można to porównać do chwilowego przełączenia kanału telewizyjnego, by sprawdzić co na innym kanale się dzieje.

source: Es können noch weitaus kompliziertere Situationen entstehen.
pl: Mimo to mogą wystąpić dużo bardziej skomplikowane sytuacje.

source: Es liegt an dir diese weise zu nutzen.
pl: Stosowanie tej możliwości zależy od ciebie

source: Es sei denn die `GIT_DIR` Umgebungsvariable wird auf das Arbeitsverzeichnis gesetzt, oder die `--bare` Option wird übergeben.
pl: Jedynie w wypadku gdy zmienna systemowa GIT_DIR ustawiona zostanie na katalog roboczy albo opcja --bare zostanie przekazana.

source: Es sieht aus als hätten wir unsere Datei überschrieben und 'commitet'.
pl: Wyglada jakbysmy ten plik zmienili i wykonali 'commit'

source: Es sieht so aus als müsste man nur ein paar Kommandozeilenskripte zusammenmixen, einen Schuß C-Code hinzufügen und innerhalb ein paar Stunden ist man fertig: eine Mischung von grundlegenden Dateisystemoperationen und SHA1-Hash-Berechnungen, garniert mit Sperrdateien und Synchronisation für Stabilität.
pl: Wygląda to jak połączenie kilku skryptów, troszeczkę kodu C i w przeciągu kilku godzin jesteśmy gotowi: zmiksowanie podstawowych operacji na systemie danych obliczenia SHA1, przyprawione danymi blokującymy i synchronizacją dla stabilności.

source: Es stellt sich heraus, dass diese Notation immer den ersten Elternteil wählt.
pl: Wychodzi na to, ze ta notacja zawsze wybiera pierwszego rodzica.

source: Etwas anderes ist der aktuelle 'Branch' im Prompt oder Fenstertitel.
pl: Czymś troszeczkę innym będzie nazwa aktualnego 'branch' w prompcie lub jako nazwa okna.

source: Fahre fort alles zu bearbeiten: Behebe Fehler, füge Funktionen hinzu, erstelle temporären Code und so weiter und 'commite' deine Änderungen oft.
pl: Zacznij po koleju odpracowywać zadania: usuń błędy, dodaj nowe funkcje, utwóż kod tymczasowy i tak dalej, i COMMITE twój kod regularnie.

source: Fahren wir fort mit der Annahme, Du hast eine Datei ``rose'' genannt.
pl: Pójdźmy dalej, zakładając, że jedną z tych danych nazwałeś ``rose''.

source: Falls das Ziel nämlich ein Arbeitsverzeichnis hat, können Verwirrungen entstehen.
pl: Jeśli cel posiadałny katalog roboczy, mogłyby powstać nieścisłości.

source: Falls deine Änderungen schief gehen, kannst du jetzt die alte Version wiederherstellen:
pl: Jesli cokolwiek staloby sie podczas wprowadzania zmian, mozesz przywrocic stara wersje

source: Falls nicht, führe *git deamon* aus und sage den Nutzern folgendes:
pl: Jeśli nie mają go, wykonaj *git daemon* i podaj im następujący link:

source: Filtere sie durch http://www.zlib.net/zpipe.c[zpipe -d], oder gib ein:
pl: Przefiltruj je najpierw przez http://www.zlib.net/zpipe.c[zpipe -d], albo wpisz:

source: Finde heraus was du seit dem letzten 'Commit' getan hast:
pl: Znajdz co zrobiles od ostatniego COMMIT:
